---
type: TableCellStyle
namespace: Autodesk.Revit.DB
version: 2024
members: 26
tags: [revit-api, class]
---

# TableCellStyle

`Autodesk.Revit.DB.TableCellStyle` · Revit 2024 · 26 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TableCellStyle | — | `` |
| Constructor | TableCellStyle | — | `public TableCellStyle ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCellStyleOverrideOptions | 2014 | `public TableCellStyleOverrideOptions GetCellStyleOverrideOptions ()` |
| Method | ResetOverride | 2014 | `public void ResetOverride ()` |
| Method | SetCellStyleOverrideOptions | 2014 | `public void SetCellStyleOverrideOptions ( TableCellStyleOverrideOptions helper )` |
| Property | BackgroundColor | — | `public Color BackgroundColor { get ; set ; }` |
| Property | BorderBottomLineStyle | — | `public ElementId BorderBottomLineStyle { get ; set ; }` |
| Property | BorderLeftLineStyle | — | `public ElementId BorderLeftLineStyle { get ; set ; }` |
| Property | BorderRightLineStyle | — | `public ElementId BorderRightLineStyle { get ; set ; }` |
| Property | BorderTopLineStyle | — | `public ElementId BorderTopLineStyle { get ; set ; }` |
| Property | FontHorizontalAlignment | — | `public HorizontalAlignmentStyle FontHorizontalAlignment { get ; set ; }` |
| Property | FontName | — | `public string FontName { get ; set ; }` |
| Property | FontVerticalAlignment | — | `public VerticalAlignmentStyle FontVerticalAlignment { get ; set ; }` |
| Property | IsEnabled | — | `public bool IsEnabled { get ; set ; }` |
| Property | IsFontBold | — | `public bool IsFontBold { get ; set ; }` |
| Property | IsFontItalic | — | `public bool IsFontItalic { get ; set ; }` |
| Property | IsFontUnderline | — | `public bool IsFontUnderline { get ; set ; }` |
| Property | IsInactivePhaseload | — | `public bool IsInactivePhaseload { get ; set ; }` |
| Property | IsOverridden | 2014 | `public bool IsOverridden { get ; }` |
| Property | IsReadOnly | — | `public bool IsReadOnly { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SheetBackgroundColor | 2014 | `public Color SheetBackgroundColor { get ; }` |
| Property | TextColor | — | `public Color TextColor { get ; set ; }` |
| Property | TextOrientation | — | `public int TextOrientation { get ; set ; }` |
| Property | TextSize | — | `public double TextSize { get ; set ; }` |